/**
 *
 *	@file		eeprom.hpp
 *
 *	@brief		EEPROM処理
 *
 *	@author		株式会社エムスクエア・ラボ　山形
 *
 *	@date		create : 2024/03/16
 *
 */
#ifndef  __EEPROM_HPP__
#define __EEPROM_HPP__

#include <Arduino.h>
/*==========================================================================================
	定数定義
==========================================================================================*/


/*==========================================================================================
	変数定義
==========================================================================================*/
/**
 * @struct	MEMORY_DATA
 * @brief		メモリーデータ
 */
struct MEMORY_DATA{
  unsigned long waitTime[2];              //設定時間
};

/**
 * @class 	IntervalTimer
 * @brief	Timer処理
 */

/*==========================================================================================
	関数定義
==========================================================================================*/

extern MEMORY_DATA memory_data;

extern void init_EEPROM();
extern void eepromSave();
#endif