/**
 *
 *	@file		timer.hpp
 *
 *	@brief		ターマー処理
 *
 *	@author		株式会社エムスクエア・ラボ　山形
 *
 *	@date		create : 2023/12/25
 *
 */
#ifndef  __TIMER_HPP__
#define __TIMER_HPP__
/*==========================================================================================
	定数定義
==========================================================================================*/


/*==========================================================================================
	変数定義
==========================================================================================*/
/**
 * @struct	
 * @brief	
 */
/**
 * @class 	IntervalTimer
 * @brief	Timer処理
 */
class IntervalTimer{
	private:
                unsigned long backTime;              //前更新時間
                unsigned long waitTime;               //設定時間


	public:
                IntervalTimer(unsigned long);    //インストラクタ
                int isWait(void);      	//時間経過確認
				void setTime(unsigned long);     	//データ初期化
                void init(void);     	//データ初期化
};
/*==========================================================================================
	関数定義
==========================================================================================*/


#endif